In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [2]:
df= pd.read_csv('Walmart.csv')
df

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48
...,...,...,...,...,...,...,...,...,...,...,...
10046,9996,WALM056,Rowlett,Fashion accessories,$37,3.0,03/08/23,10:10:00,Cash,3.0,0.33
10047,9997,WALM030,Richardson,Home and lifestyle,$58,2.0,22/02/21,14:20:00,Cash,7.0,0.48
10048,9998,WALM050,Victoria,Fashion accessories,$52,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
10049,9999,WALM032,Tyler,Home and lifestyle,$79,2.0,25/02/21,12:25:00,Cash,7.0,0.48
10050,10000,WALM069,Rockwall,Fashion accessories,$62,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [3]:
df.shape

(10051, 11)

In [4]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [6]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [7]:
df.duplicated().sum()

51

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
df.dropna(inplace=True)

In [10]:
df.shape

(9969, 11)

In [11]:
df['unit_price']=df['unit_price'].str.replace('$', '').astype(float)
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [12]:
df['total']=df['unit_price']*df['quantity']
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [13]:
df.to_csv('walmart_clean_data.csv', index=False)

In [14]:
df.columns=df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')

In [26]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

# ============================
# MySQL Connection
# ============================
conn = pymysql.connect(
    host='localhost',
    user='root',
    password='mahadev@9096',
    db='customer_behavior',
    port=3306
)

# SQLAlchemy engine (URL-encoded password)
engine = create_engine(
    "mysql+pymysql://root:mahadev%409096@localhost:3306/customer_behavior"
)
table_name = "walmart_data"

df.to_sql(
    table_name,
    engine,
    if_exists="replace",
    index=False
)

print(f"Data inserted into table: {table_name}")

# ============================
# Read Back Sample
# ============================
result = pd.read_sql("SELECT * FROM walmart_data LIMIT 5;", engine)
print(result)

Data inserted into table: walmart_data
         0       1       2      3
0  WALM045  1731.0   647.0  62.62
1  WALM047  2581.0  1069.0  58.58
2  WALM098  2446.0  1030.0  57.89
3  WALM033  2099.0   931.0  55.65
4  WALM081  1723.0   850.0  50.67

In [16]:
import pandas as pd
import matplotlib.pyplot as plt
import pymysql

db = pymysql.connect(
    host="localhost",
    user="root",
    password="mahadev@9096",
    database="customer_behavior",
    port=3306
)

cur = db.cursor()

Q1: Find different payment methods, number of transactions, and quantity sold by payment method

In [17]:
query = """ SELECT 
    payment_method,
    COUNT(*) AS no_payments,
    SUM(quantity) AS no_qty_sold
FROM walmart
GROUP BY payment_method; """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

             0     1       2
0      Ewallet  3881  8932.0
1         Cash  1832  4984.0
2  Credit card  4256  9567.0

Q2.Identify the highest-rated category in each branch

In [18]:
query = """ SELECT branch, category, avg_rating
FROM (
    SELECT 
        branch,
        category,
        AVG(rating) AS avg_rating,
        RANK() OVER (PARTITION BY branch ORDER BY AVG(rating) DESC) AS rnk
    FROM walmart
    GROUP BY branch, category
) AS ranked
WHERE rnk = 1;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

         0                       1         2
0  WALM001  Electronic accessories  7.450000
1  WALM002      Food and beverages  8.250000
2  WALM003       Sports and travel  7.500000
3  WALM004      Food and beverages  9.300000
4  WALM005       Health and beauty  8.366667

Q3.Identify the busiest day for each branch based on the number of transactions

In [19]:
query = """ SELECT branch, day_name, no_transactions
FROM (
    SELECT 
        branch,
        DAYNAME(STR_TO_DATE(date, '%d/%m/%Y')) AS day_name,
        COUNT(*) AS no_transactions,
        RANK() OVER(PARTITION BY branch ORDER BY COUNT(*) DESC) AS rnk
    FROM walmart
    GROUP BY branch, day_name
) AS ranked
WHERE rnk = 1;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

         0          1   2
0  WALM001   Thursday  16
1  WALM002   Thursday  15
2  WALM003    Tuesday  33
3  WALM004     Sunday  14
4  WALM005  Wednesday  19

 Q4.Calculate the total quantity of items sold per payment method

In [20]:
query = """ SELECT 
    payment_method,
    SUM(quantity) AS no_qty_sold
FROM walmart
GROUP BY payment_method;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

             0       1
0      Ewallet  8932.0
1         Cash  4984.0
2  Credit card  9567.0

Q5.Determine the average, minimum, and maximum rating of categories for each city

In [21]:
query = """ SELECT 
    city,
    category,
    MIN(rating) AS min_rating,
    MAX(rating) AS max_rating,
    AVG(rating) AS avg_rating
FROM walmart
GROUP BY city, category;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

             0                       1    2    3         4
0  San Antonio       Health and beauty  5.0  9.1  7.050000
1    Harlingen  Electronic accessories  9.6  9.6  9.600000
2  Haltom City      Home and lifestyle  3.0  9.5  6.227778
3      Bedford       Health and beauty  6.1  9.3  8.150000
4       Irving       Sports and travel  5.3  5.3  5.300000

Q6.Calculate the total profit for each category

In [22]:
query = """ SELECT 
    category,
    SUM(unit_price * quantity * profit_margin) AS total_profit
FROM walmart
GROUP BY category
ORDER BY total_profit DESC;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

                        0            1
0     Fashion accessories  192314.8932
1      Home and lifestyle  192213.6381
2  Electronic accessories   30772.4895
3      Food and beverages   21552.8622
4       Sports and travel   20613.8082

Q7.Determine the most common payment method for each branch

In [23]:
query = """ WITH cte AS (
    SELECT 
        branch,
        payment_method,
        COUNT(*) AS total_trans,
        RANK() OVER(PARTITION BY branch ORDER BY COUNT(*) DESC) AS rnk
    FROM walmart
    GROUP BY branch, payment_method
)
SELECT branch, payment_method AS preferred_payment_method
FROM cte
WHERE rnk = 1;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

         0            1
0  WALM001      Ewallet
1  WALM002      Ewallet
2  WALM003  Credit card
3  WALM004      Ewallet
4  WALM005      Ewallet

Q8.Categorize sales into Morning, Afternoon, and Evening shifts

In [24]:
query = """ SELECT
    branch,
    CASE 
        WHEN HOUR(TIME(time)) < 12 THEN 'Morning'
        WHEN HOUR(TIME(time)) BETWEEN 12 AND 17 THEN 'Afternoon'
        ELSE 'Evening'
    END AS shift,
    COUNT(*) AS num_invoices
FROM walmart
GROUP BY branch, shift
ORDER BY branch, num_invoices DESC;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

         0          1   2
0  WALM001  Afternoon  36
1  WALM001    Evening  30
2  WALM001    Morning   8
3  WALM002  Afternoon  29
4  WALM002    Evening  21

Q9.Identify the 5 branches with the highest revenue decrease ratio from last year to current year (e.g., 2022 to 2023)

In [25]:
query = """ WITH revenue_2022 AS (
    SELECT 
        branch,
        SUM(total) AS revenue
    FROM walmart
    WHERE YEAR(STR_TO_DATE(date, '%d/%m/%Y')) = 2022
    GROUP BY branch
),
revenue_2023 AS (
    SELECT 
        branch,
        SUM(total) AS revenue
    FROM walmart
    WHERE YEAR(STR_TO_DATE(date, '%d/%m/%Y')) = 2023
    GROUP BY branch
)
SELECT 
    r2022.branch,
    r2022.revenue AS last_year_revenue,
    r2023.revenue AS current_year_revenue,
    ROUND(((r2022.revenue - r2023.revenue) / r2022.revenue) * 100, 2) AS revenue_decrease_ratio
FROM revenue_2022 AS r2022
JOIN revenue_2023 AS r2023 ON r2022.branch = r2023.branch
WHERE r2022.revenue > r2023.revenue
ORDER BY revenue_decrease_ratio DESC
LIMIT 5;"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)
df.head()

         0       1       2      3
0  WALM045  1731.0   647.0  62.62
1  WALM047  2581.0  1069.0  58.58
2  WALM098  2446.0  1030.0  57.89
3  WALM033  2099.0   931.0  55.65
4  WALM081  1723.0   850.0  50.67